output-multi-vm-4c3d2776/ycsbVMs_ycsb_16vms_bridge-vhost_-1rps_rep1/vm6.log
/nix/store/2vwkssqpzykk37r996cafq7x63imf4sp-openjdk-21+35/bin/java  -classpath /nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/conf:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/core-0.17.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/HdrHistogram-2.1.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/htrace-core4-4.1.0-incubating.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-core-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/lib/jackson-mapper-asl-1.9.4.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/commons-pool2-2.4.2.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/jedis-2.9.0.jar:/nix/store/zw02np72fzsmga6s5mphhw7x8qlzf4sv-ycsb-0.17.0/share/redis-binding/lib/redis-binding-0.17.0.jar site.ycsb.Client -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6379 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
Command line: -t -db site.ycsb.db.RedisClient -s -P /home/host/vmuxIO/test/moonprogs//../../ycsb/share/workloads/workloada -p redis.host=10.1.0.2 -p redis.port=6379 -p operationcount=429496729 -p maxexecutiontime=61 -threads 1
YCSB Client 0.17.0

Loading workload...
Starting test.
Maximum execution time specified as: 61 secs
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
2024-06-19 17:13:49:238 0 sec: 0 operations; est completion in 0 second 
2024-06-19 17:13:59:052 10 sec: 92470 operations; 9245.15 current ops/sec; est completion in 12 hours 54 minutes [READ: Count=45997, Max=53535, Min=67, Avg=104.63, 90=127, 99=162, 99.9=730, 99.99=3813] [UPDATE: Count=46483, Max=12871, Min=65, Avg=101.96, 90=125, 99=171, 99.9=712, 99.99=3533] 
2024-06-19 17:14:09:051 20 sec: 192762 operations; 10030.2 current ops/sec; est completion in 12 hours 22 minutes [READ: Count=50123, Max=1385, Min=68, Avg=99.44, 90=119, 99=144, 99.9=293, 99.99=658] [UPDATE: Count=50159, Max=876, Min=66, Avg=96.48, 90=117, 99=139, 99.9=278, 99.99=452] 
2024-06-19 17:14:19:051 30 sec: 285298 operations; 9253.6 current ops/sec; est completion in 12 hours 32 minutes [READ: Count=46481, Max=9423, Min=77, Avg=108.55, 90=128, 99=159, 99.9=304, 99.99=1235] [UPDATE: Count=46055, Max=4001, Min=73, Avg=104.59, 90=124, 99=156, 99.9=338, 99.99=1590] 
2024-06-19 17:14:29:051 40 sec: 378026 operations; 9272.8 current ops/sec; est completion in 12 hours 36 minutes [READ: Count=46432, Max=1152, Min=76, Avg=108.57, 90=126, 99=145, 99.9=209, 99.99=542] [UPDATE: Count=46296, Max=4061, Min=73, Avg=104.01, 90=122, 99=139, 99.9=182, 99.99=398] 
2024-06-19 17:14:39:051 50 sec: 470258 operations; 9223.2 current ops/sec; est completion in 12 hours 40 minutes [READ: Count=45978, Max=4151, Min=79, Avg=109.18, 90=128, 99=155, 99.9=257, 99.99=744] [UPDATE: Count=46254, Max=7099, Min=74, Avg=104.54, 90=123, 99=149, 99.9=232, 99.99=677] 
2024-06-19 17:14:49:051 60 sec: 563328 operations; 9307 current ops/sec; est completion in 12 hours 41 minutes [READ: Count=46602, Max=6223, Min=78, Avg=108.5, 90=126, 99=150, 99.9=328, 99.99=2495] [UPDATE: Count=46468, Max=3919, Min=76, Avg=103.26, 90=121, 99=143, 99.9=286, 99.99=1288] 
Maximum time elapsed. Requesting stop for the workload.
Stop requested for workload. Now Joining!
2024-06-19 17:14:50:066 61 sec: 571916 operations; 8469.43 current ops/sec; est completion in 12 hours 42 minutes [READ: Count=4241, Max=8999, Min=83, Avg=119.05, 90=134, 99=159, 99.9=443, 99.99=8999] [CLEANUP: Count=1, Max=2181, Min=2180, Avg=2181, 90=2181, 99=2181, 99.9=2181, 99.99=2181] [UPDATE: Count=4347, Max=902, Min=81, Avg=112.28, 90=128, 99=150, 99.9=330, 99.99=902] 
[OVERALL], RunTime(ms), 61020
[OVERALL], Throughput(ops/sec), 9372.599147820387
[TOTAL_GCS_Copy], Count, 53
[TOTAL_GC_TIME_Copy], Time(ms), 40
[TOTAL_GC_TIME_%_Copy], Time(%), 0.06555227794165848
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 53
[TOTAL_GC_TIME], Time(ms), 40
[TOTAL_GC_TIME_%], Time(%), 0.06555227794165848
[READ], Operations, 285854
[READ], AverageLatency(us), 106.57407977499003
[READ], MinLatency(us), 67
[READ], MaxLatency(us), 53535
[READ], 95thPercentileLatency(us), 133
[READ], 99thPercentileLatency(us), 153
[READ], Return=OK, 285854
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2181.0
[CLEANUP], MinLatency(us), 2180
[CLEANUP], MaxLatency(us), 2181
[CLEANUP], 95thPercentileLatency(us), 2181
[CLEANUP], 99thPercentileLatency(us), 2181
[UPDATE], Operations, 286062
[UPDATE], AverageLatency(us), 102.5388272472401
[UPDATE], MinLatency(us), 65
[UPDATE], MaxLatency(us), 12871
[UPDATE], 95thPercentileLatency(us), 128
[UPDATE], 99thPercentileLatency(us), 149
[UPDATE], Return=OK, 286062
AUTOTEST_DONE